Revit 2026 API

# WorksetFilter Properties

---

The WorksetFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IncludeStandaloneWorksetsOnly | True if the results of the filter only match stand-alone worksets; worksets that are not stand-alone will be rejected. |
|  | Inverted | True if the results of the filter are inverted; worksets that would normally be accepted by this filter will be rejected, and worksets that would normally be rejected will be accepted. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

WorksetFilter Class

Autodesk.Revit.DB Namespace